cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32HG308.svd
        <register>
          <name>STATUS</name>
          <description>USART Status Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>RXENS</name>
              <description>Receiver Enable Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXENS</name>
              <description>Transmitter Enable Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER</name>
              <description>SPI Master Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBLOCK</name>
              <description>Block Incoming Data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTRI</name>
              <description>Transmitter Tristated</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXC</name>
              <description>TX Complete</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBL</name>
              <description>TX Buffer Level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAV</name>
              <description>RX Data Valid</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>RX FIFO Full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBDRIGHT</name>
              <description>TX Buffer Expects Double Right Data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBSRIGHT</name>
              <description>TX Buffer Expects Single Right Data</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAVRIGHT</name>
              <description>RX Data Right</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFULLRIGHT</name>
              <description>RX Full of Right Data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>Clock Control Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFF8</resetMask>
          <fields>
            <field>
              <name>DIVEXT</name>
              <description>Extended Fractional Clock Divider</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>Fractional Clock Divider</description>
              <bitOffset>6</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATAX</name>
          <description>RX Buffer Data Extended Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000C1FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>RX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Data Parity Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Data Framing Error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATA</name>
          <description>RX Buffer Data Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>RX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDOUBLEX</name>
          <description>RX Buffer Double Data Extended Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC1FFC1FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXDATA0</name>
              <description>RX Data 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR0</name>
              <description>Data Parity Error 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR0</name>
              <description>Data Framing Error 0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATA1</name>
              <description>RX Data 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR1</name>
              <description>Data Parity Error 1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR1</name>
              <description>Data Framing Error 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDOUBLE</name>
          <description>RX FIFO Double Data Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXDATA0</name>
              <description>RX Data 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATA1</name>
              <description>RX Data 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATAXP</name>
          <description>RX Buffer Data Extended Peek Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000C1FF</resetMask>
          <fields>
            <field>
              <name>RXDATAP</name>
              <description>RX Data Peek</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERRP</name>
              <description>Data Parity Error Peek</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERRP</name>
              <description>Data Framing Error Peek</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDOUBLEXP</name>
          <description>RX Buffer Double Data Extended Peek Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC1FFC1FF</resetMask>
          <fields>
            <field>
              <name>RXDATAP0</name>
              <description>RX Data 0 Peek</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERRP0</name>
              <description>Data Parity Error 0 Peek</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERRP0</name>
              <description>Data Framing Error 0 Peek</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAP1</name>
              <description>RX Data 1 Peek</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERRP1</name>
              <description>Data Parity Error 1 Peek</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERRP1</name>
              <description>Data Framing Error 1 Peek</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATAX</name>
          <description>TX Buffer Data Extended Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000F9FF</resetMask>
          <fields>
            <field>
              <name>TXDATAX</name>
              <description>TX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UBRXAT</name>
              <description>Unblock RX After Transmission</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTRIAT</name>
              <description>Set TXTRI After Transmission</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBREAK</name>
              <description>Transmit Data As Break</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDISAT</name>
              <description>Clear TXEN After Transmission</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXENAT</name>
              <description>Enable RX After Transmission</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA</name>
          <description>TX Buffer Data Register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>TX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDOUBLEX</name>
          <description>TX Buffer Double Data Extended Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF9FFF9FF</resetMask>
          <fields>
            <field>
              <name>TXDATA0</name>
              <description>TX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UBRXAT0</name>
              <description>Unblock RX After Transmission</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTRIAT0</name>
              <description>Set TXTRI After Transmission</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBREAK0</name>
              <description>Transmit Data As Break</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDISAT0</name>
              <description>Clear TXEN After Transmission</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXENAT0</name>
              <description>Enable RX After Transmission</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDATA1</name>
              <description>TX Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UBRXAT1</name>
              <description>Unblock RX After Transmission</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTRIAT1</name>
              <description>Set TXTRI After Transmission</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBREAK1</name>
              <description>Transmit Data As Break</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDISAT1</name>
              <description>Clear TXEN After Transmission</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXENAT1</name>
              <description>Enable RX After Transmission</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDOUBLE</name>
          <description>TX Buffer Double Data Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TXDATA0</name>
              <description>TX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDATA1</name>
              <description>TX Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>TXC</name>
              <description>TX Complete Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBL</name>
              <description>TX Buffer Level Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDATAV</name>
              <description>RX Data Valid Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>RX Buffer Full Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOF</name>
              <description>RX Overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXUF</name>
              <description>RX Underflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOF</name>
              <description>TX Overflow Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXUF</name>
              <description>TX Underflow Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity Error Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Framing Error Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MPAF</name>
              <description>Multi-Processor Address Frame Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSM</name>
              <description>Slave-Select In Master Mode Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCF</name>
              <description>Collision Check Fail Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
